In [1]:
import pandas as pd
import numpy as np

In [2]:
a = pd.Series([2,5,77,99,100])
a

0      2
1      5
2     77
3     99
4    100
dtype: int64

In [4]:
b = a.values
b

array([  2,   5,  77,  99, 100])

In [5]:
type(b)

numpy.ndarray

In [8]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
a.index = ['a', 'b', 'c', 'd', 'e' ]
a.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [12]:
a.index[0]

'a'

In [13]:
a.index[1]

'b'

In [18]:
pd.concat([a,a])

a      2
b      5
c     77
d     99
e    100
a      2
b      5
c     77
d     99
e    100
dtype: int64

In [19]:
pd.concat([a,a], axis = 0)

a      2
b      5
c     77
d     99
e    100
a      2
b      5
c     77
d     99
e    100
dtype: int64

In [24]:
c = pd.concat([a,a], axis = 1)
c

     0    1
a    2    2
b    5    5
c   77   77
d   99   99
e  100  100

In [25]:
c.axes

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object'),
 RangeIndex(start=0, stop=2, step=1)]

In [32]:
c.columns = ['var1', 'var2']
c

   var1  var2
a     2     2
b     5     5
c    77    77
d    99    99
e   100   100

In [33]:
c.axes

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object'),
 Index(['var1', 'var2'], dtype='object')]

In [36]:
c.items()

In [38]:
e = list(c.items())
e

[('var1',
  a      2
  b      5
  c     77
  d     99
  e    100
  Name: var1, dtype: int64),
 ('var2',
  a      2
  b      5
  c     77
  d     99
  e    100
  Name: var2, dtype: int64)]

In [39]:
e[0]

('var1',
 a      2
 b      5
 c     77
 d     99
 e    100
 Name: var1, dtype: int64)

In [40]:
e[0][0]

'var1'

In [41]:
e[0][1]

a      2
b      5
c     77
d     99
e    100
Name: var1, dtype: int64

In [42]:
e[0][1][0]

2

In [45]:
c

   var1  var2
a     2     2
b     5     5
c    77    77
d    99    99
e   100   100

In [56]:
type(c)

pandas.core.frame.DataFrame

In [62]:
c.index = [0,1,2,3,4]
c

   var1  var2
0     2     2
1     5     5
2    77    77
3    99    99
4   100   100

In [63]:
c[0:2]

   var1  var2
0     2     2
1     5     5

In [64]:
c[0:2]['var1']

0    2
1    5
Name: var1, dtype: int64

In [66]:
c['var1']

0      2
1      5
2     77
3     99
4    100
Name: var1, dtype: int64

In [67]:
c.size

10

## LOC , ILOC islemleri

In [68]:
c

   var1  var2
0     2     2
1     5     5
2    77    77
3    99    99
4   100   100

In [72]:
c.loc[0:2, 'var1'] # index 2 Dahil

0     2
1     5
2    77
Name: var1, dtype: int64

In [73]:
c.iloc[0:2]['var1'] # 2 Dahil degil

0    2
1    5
Name: var1, dtype: int64

In [75]:
'var1' in c

True

In [78]:
77 in c

False

In [79]:
m = np.random.randint(1,1000, size = (10,3))
df = pd.DataFrame(m, columns = ['var1', 'var2', 'var3' ])
df

   var1  var2  var3
0    44   832   921
1   206   816   137
2   829   666    90
3    44   567   284
4   146    87   326
5   402    95   567
6    20   982   503
7   571   231   609
8   221   255    34
9   906   506   167

In [80]:
df[0:2]

   var1  var2  var3
0    44   832   921
1   206   816   137

In [81]:
df.iloc[0:2]

   var1  var2  var3
0    44   832   921
1   206   816   137

In [82]:
df[0:2][['var1', 'var2']]

   var1  var2
0    44   832
1   206   816

In [83]:
df.iloc[0:2][['var1', 'var2']]

   var1  var2
0    44   832
1   206   816

In [86]:
df.loc[0:2, ['var1','var2']]

   var1  var2
0    44   832
1   206   816
2   829   666

In [87]:
df

   var1  var2  var3
0    44   832   921
1   206   816   137
2   829   666    90
3    44   567   284
4   146    87   326
5   402    95   567
6    20   982   503
7   571   231   609
8   221   255    34
9   906   506   167

In [88]:
df[df.var1 < 200]

   var1  var2  var3
0    44   832   921
3    44   567   284
4   146    87   326
6    20   982   503

In [90]:
df[(df.var1 < 200) & (df.var2 >600)]

   var1  var2  var3
0    44   832   921
6    20   982   503

In [99]:
df[(df.var1 < 200) & (df.var2 >600) & (df.var3 > 600)]

   var1  var2  var3
0    44   832   921

In [100]:
df[(df.var1 < 200) & (df.var2 >600) & (df.var3 > 600)][['var1', 'var2']]

   var1  var2
0    44   832

In [101]:
df

   var1  var2  var3
0    44   832   921
1   206   816   137
2   829   666    90
3    44   567   284
4   146    87   326
5   402    95   567
6    20   982   503
7   571   231   609
8   221   255    34
9   906   506   167

In [105]:
df.loc[df.var1 > 900 ]

   var1  var2  var3
9   906   506   167

In [107]:
# df[df.var1 >900 , 'var1'] ======> Hata Uretir

In [108]:
df.loc[df.var1 > 900 , 'var1']

9    906
Name: var1, dtype: int64

In [109]:
df.loc[df.var1 > 900 , ['var1', 'var2']]

   var1  var2
9   906   506